export type Book = {
  id: string;
  title: string;
  rating: number;
  description: string;
  price: number;
  cover?: string;
};

export const books: Book[] = [
  {
    id: '1',
    title: 'Война и мир',
    rating: 4.7,
    description:
      '«Война́ и мир» — роман-эпопея Льва Николаевича Толстого, описывающий русское общество в эпоху войн против Наполеона в 1805—1812 годах. Эпилог романа доводит повествование до 1820 года.',
    price: 1500,
    cover: '../assets/voina_i_mir.jpg',
  },
  {
    id: '2',
    title: 'На Западном фронте без перемен',
    rating: 4.9,
    description:
      '«На Западном фронте без перемен» или «На Западе без перемен» — роман Эриха Марии Ремарка, опубликованный в газетном варианте в 1928 году, а отдельной книгой в 1929 году. В предисловии автор говорит: «Эта книга не является ни обвинением, ни исповедью.',
    price: 1200,
    cover: '../assets/na-zapadnom-fronte-bez-peremen.jpg',
  },
  {
    id: '3',
    title: 'Дюна',
    rating: 5.0,
    description:
      '«Дю́на» — эпический научно-фантастический роман американского писателя Фрэнка Герберта, впервые опубликованный в 1963—1965 годах в виде серии глав в журнале Analog Science Fiction and Fact и в 1965 году впервые изданный отдельной книгой. Книга, сделавшая Герберта знаменитым, была удостоена премий Хьюго и Небьюла.',
    price: 2000,
    cover: '../assets/duna.jpg',
  },
  {
    id: '4',
    title: '1984',
    rating: 4.4,
    description:
      '«1984» — роман-антиутопия Джорджа Оруэлла о тоталитарном обществе с культом личности партийного лидера Большого Брата, постоянным правительственным контролем повседневной жизни и регулярными войнами. Изданный в 1949 году роман стал последним и, по господствующему мнению, самым главным произведением писателя.',
    price: 1800,
    cover: '../assets/1984.jpg',
  },
  {
    id: '5',
    title: 'Преступление и наказание',
    rating: 4.6,
    description:
      '«Преступле́ние и наказа́ние» — социально-психологический и социально-философский роман Фёдора Михайловича Достоевского, над которым писатель работал в 1865—1866 годах. Впервые опубликован в 1866 году в журнале «Русский вестник».',
    price: 1500,
    cover: '../assets/prestuplenie_i_nakazanie.webp',
  },
];
